package com.dalao.ui;

public class test {


   /* int count = 1;//记录当前我是跟第几个敌人进行战斗
    int win = 0;//记录了胜利了几场

    // 外循环:我现在要跟多个敌人进行战
    while(player.isAlive()){

        //5.1重置敌人的属性
        //5.2随机抽取敌人
        //5.3开始跟抽取到敌人进行战斗
        //    回合制(你打我一下，我打你一下)11
        //    内循环:跟单个敌人进行多轮战斗，直到有一方的血量为才会结束

        int round = 1;//记录跟单个敌人战斗多少回合

        // 内循环;跟单个敌人进行多回合的战斗
        while (player.isAlive()) {
            // 我打敌人一下
            // 判断敌人的血量是否为0.如果为0.结束当前的成斗。维续跟下一个敌人进行战斗(结束内循环，继续执行外循环)
            // 敌人打我一下
            // 判断我的血量是否为0。如果为0。结束整个游戏
            // 如果我的血量不为0.继续执行内循环。开始下一个回合 round++;
        }

        //5.4跟单个敌人结束战斗(结算，回血。3场增加我方人物的属性点，询问y/n y)
    }

    //最终结算*/

}

